app/controllers/posts_controller.rb

UPDATE "posts" SET "updated_at" = '2025-08-08 01:59:34.922801' WHERE "posts"."id" = 1
---
  def update
    if @post.update(post_params)