app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @categories = Category.all
    if params[:category_id].present?
      @category = Category.find(params[:category_id])
      @posts = @category.posts.includes(:category)

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ('test post', 'asdfasdfasdfasdfas', '2025-08-08 01:59:34.873773', '2025-08-08 01:59:34.873773') RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    if @post.save

UPDATE "posts" SET "updated_at" = '2025-08-08 02:00:42.745673' WHERE "posts"."id" = 1
---
  def update
    if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
---
    def set_post
      @post = Post.find(params.expect(:id))